{
  "characters": [
    {
      "name": "Sung Jin-Woo",
      "role": "protagoniste",
      "provenance": "Solo Leveling",
      "origine": "Solo Leveling",
      "description": "Sung Jin-Woo est le protagoniste de l'histoire. Il est un chasseur de rang E et est connu comme le chasseur le plus faible du monde. C'est une personne travailleuse et déterminée qui est prête à tout pour protéger sa famille.",
      "equipements": [
        {
          "nom": "Dague",
          "description": "Une dague que Sung Jin-Woo utilise pour combattre les monstres."
        },
        {
          "nom": "Armure",
          "description": "Un ensemble d'armure que Sung Jin-Woo utilise pour se protéger des monstres."
        }
      ],
      "abilities": [
        {
          "nom": "Échange d'Ombre",
          "description": "Sung Jin-Woo peut échanger de place avec son ombre."
        },
        {
          "nom": "Extraction d'Ombre",
          "description": "Sung Jin-Woo peut extraire des ombres des monstres et les utiliser pour se battre."
        }
      ],
      "image": "./static/img/sung_jin_woo_7220.png"
    },
    {
      "name": "Monkey D. Luffy",
      "role": "protagoniste",
      "provenance": "One Piece",
      "origine": "One Piece",
      "description": "Monkey D. Luffy est le capitaine des Pirates au Chapeau de Paille et est connu pour ses abilities semblables au caoutchouc après avoir mangé le Fruit du Démon Gomu Gomu no Mi. Il rêve de trouver le légendaire trésor One Piece et de devenir le Roi des Pirates.",
      "equipements": [
        {
          "nom": "Chapeau de Paille",
          "description": "Le chapeau de paille emblématique de Luffy."
        },
        {
          "nom": "Gomu Gomu no Mi",
          "description": "Le Fruit du Démon qui donne à Luffy des abilities semblables au caoutchouc."
        }
      ],
      "abilities": [
        {
          "nom": "Pistolet Gum-Gum",
          "description": "Luffy étire son bras et délivre un puissant coup de poing."
        },
        {
          "nom": "Gatling Gum-Gum",
          "description": "Luffy frappe rapidement son adversaire avec une vitesse incroyable."
        }
      ],
      "image": "./static/img/monkey_d_luffy.png"
    },
    {
      "name": "Geralt de Riv",
      "role": "protagoniste",
      "provenance": "The Witcher",
      "origine": "The Witcher",
      "description": "Geralt de Riv est un chasseur de monstres, également connu sous le nom de Sorceleur, muté pour avoir des abilities surhumaines et entraîné pour combattre des créatures monstrueuses. Il parcourt le Continent en tuant des bêtes et en recherchant sa fille adoptive, Ciri.",
      "equipements": [
        {
          "nom": "Épée en acier",
          "description": "Une épée utilisée pour tuer les créatures non magiques."
        },
        {
          "nom": "Épée en argent",
          "description": "Une épée utilisée pour tuer les créatures magiques."
        },
        {
          "nom": "Médaillon de Sorceleur",
          "description": "Un médaillon qui vibre en présence de magie."
        }
      ],
      "abilities": [
        {
          "nom": "Signes de Sorceleur",
          "description": "Geralt peut lancer des signes magiques incluant Igni (feu), Quen (bouclier) et Aard (télékinésie)."
        },
        {
          "nom": "Sens Accrus",
          "description": "Geralt a des sens, des réflexes et une force accrus grâce aux mutations de Sorceleur."
        }
      ],
      "image": "./static/img/geralt_of_rivia.jpg"
    }
  ]
}
