{
  "characters": [
    {
      "name": "Sung Jin-Woo",
      "role": "protagoniste",
      "provenance": "Solo Leveling",
      "origine": "Solo Leveling",
      "description": "Sung Jin-Woo est le protagoniste de l'histoire. Il est un chasseur de rang E et est connu comme le chasseur le plus faible du monde. C'est une personne travailleuse et déterminée qui est prête à tout pour protéger sa famille.",
      "equipements": [
        {
          "nom": "Dague",
          "description": "Une dague que Sung Jin-Woo utilise pour combattre les monstres."
        },
        {
          "nom": "Armure",
          "description": "Un ensemble d'armure que Sung Jin-Woo utilise pour se protéger des monstres."
        }
      ],
      "abilities": [
        {
          "nom": "Échange d'Ombre",
          "description": "Sung Jin-Woo peut échanger de place avec son ombre."
        },
        {
          "nom": "Extraction d'Ombre",
          "description": "Sung Jin-Woo peut extraire des ombres des monstres et les utiliser pour se battre."
        }
      ],
      "image": "./static/img/sung_jin_woo_7220.png"
    },
    {
      "name": "Monkey D. Luffy",
      "role": "protagoniste",
      "provenance": "One Piece",
      "origine": "One Piece",
      "description": "Monkey D. Luffy est le capitaine des Pirates au Chapeau de Paille et est connu pour ses abilities semblables au caoutchouc après avoir mangé le Fruit du Démon Gomu Gomu no Mi. Il rêve de trouver le légendaire trésor One Piece et de devenir le Roi des Pirates.",
      "equipements": [
        {
          "nom": "Chapeau de Paille",
          "description": "Le chapeau de paille emblématique de Luffy."
        },
        {
          "nom": "Gomu Gomu no Mi",
          "description": "Le Fruit du Démon qui donne à Luffy des abilities semblables au caoutchouc."
        }
      ],
      "abilities": [
        {
          "nom": "Pistolet Gum-Gum",
          "description": "Luffy étire son bras et délivre un puissant coup de poing."
        },
        {
          "nom": "Gatling Gum-Gum",
          "description": "Luffy frappe rapidement son adversaire avec une vitesse incroyable."
        }
      ],
      "image": "./static/img/luffy.png"
    },
    {
      "name": "Naruto Uzumaki",
      "role": "protagoniste",
      "provenance": "Naruto",
      "origine": "Naruto",
      "description": "Naruto Uzumaki est un ninja du village caché de Konoha et est connu pour être l'hôte du démon-renard à neuf queues. Il est déterminé à devenir le Hokage de Konoha et à protéger ses amis.",
      "equipements": [
        {
          "nom": "Kunai",
          "description": "Un couteau de lancer que Naruto utilise pour combattre."
        },
        {
          "nom": "Shuriken",
          "description": "Une étoile de ninja que Naruto utilise pour combattre."
        }
      ],
      "abilities": [
        {
          "nom": "Rasengan",
          "description": "Une technique de type tourbillon que Naruto utilise pour attaquer ses ennemis."
        },
        {
          "nom": "Kage Bunshin no Jutsu",
          "description": "Une technique qui crée des clones de Naruto pour combattre ses ennemis."
        }
      ],
      "image": "./static/img/naruto.png"
    }
  ]
}
